.config/doom/config.org
#+title: Doom Emacs Config

* Basics & Interface
** Basics
#+begin_src elisp
(setq user-full-name "hedy"
      user-mail-address "hedy@tilde.cafe")
#+end_src

Can set to relative or nil
#+begin_src elisp
(setq diplay-line-numbers-type t)
#+end_src

Seriously? I just want to quit. Damn. Why confirm lol
#+begin_src elisp
(setq confirm-kill-emacs nil)
#+end_src

Scroll margin like =scrolloff= in vim (not tangled)
#+begin_src elisp :tangle no
(setq scroll-margin 6)
#+end_src

Horizontal scrolling is pain
#+begin_src elisp
(global-visual-line-mode t)
#+end_src

Give it the IDE vibes
#+begin_src elisp :tangle no
; (run-with-timer 1 nil (lambda () (save-selected-window (treemacs))))
#+end_src

Indentation
#+begin_src elisp
(setq evil-shift-width 2)
(setq tab-width 4)
#+end_src

Forgot why this was needed...
#+begin_src elisp
(defun set-exec-path-from-shell-PATH ()
  "Set up Emacs' `exec-path' and PATH environment variable to match that used by the user's shell.

This is particularly useful under Mac OS X and macOS, where GUI apps are not started from a shell."
  (interactive)
  (let ((path-from-shell
         (replace-regexp-in-string "[ \t\n]*$" ""
          (shell-command-to-string ;;SHELL = fish
           "$SHELL --login -c 'string join : $PATH'"))))
    (setenv "PATH" path-from-shell)
    (setq exec-path (split-string path-from-shell path-separator))))

(set-exec-path-from-shell-PATH)
#+end_src

** UI
#+begin_src elisp
(setq doom-modeline-height 40)
#+end_src

** Window management

#+begin_src elisp
;; https://www.emacswiki.org/emacs/ToggleWindowSplit
(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))

(define-key ctl-x-4-map "t" 'toggle-window-split)
#+end_src

** Font

Doom exposes five (optional) variables for controlling fonts in Doom. Here are the three important ones:

+ =doom-font=
+ =doom-variable-pitch-font=
+ =doom-big-font= -- used for =doom-big-font-mode=; use this for presentations or streaming.

They all accept either a font-spec, font string =("Input Mono-12")=, or xlfd font string. You generally only need these two:

#+begin_src elisp :tangle no
(setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "sans" :size 13))
#+end_src

Here is my configuration:

#+begin_src elisp
(setq doom-font (font-spec :family "Fira Code" :size 16 :weight 'normal)
      doom-variable-pitch-font (font-spec :family "Open Sans" :size 18 :weight 'light))
#+end_src

** Theme

There are two ways to load a theme. Both assume the theme is installed and available. You can either set =doom-theme= or manually load a theme with the =load-thee= function.

#+begin_src elisp
(setq doom-theme 'doom-vibrant) ;; Doom's dracula is a bit funny
#+end_src

** Configuration macros

Here are some additional functions/macros that could help you configure Doom:

- =load!= for loading external *.el files relative to this one
- =use-package!= for configuring packages
- =after!= for running code after a package has loaded
- =add-load-path!= for adding directories to the =load-path=, relative to this file. Emacs searches the =load-path= when you load packages with =require= or =use-package=.
- =map!= for binding new keys


* Evil
#+begin_src elisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+end_src

** FIXING EVIL YANK DON'T USE CLIPBOARD
Workaround from:

https://discourse.doomemacs.org/t/how-to-set-up-clipboard/3742

#+begin_src elisp
;; don't put deleted strings to X11 clipboard
(setq select-enable-clipboard nil)
;; copying and pasting selected blocks in visual mode to and from X11 clipboard
(map! "S-C-c" #'clipboard-kill-ring-save)
(map! "S-C-v" #'clipboard-yank)
#+end_src

How to use yank/paste and system clipboard:

- Anything copied outside of emacs, paste in emacs with S-C-v
- Yank within emacs, will not override clipboard outside emacs
- To paste yanks within emacs, use default paste bind or use p
- Copy sth to clipboard from emacs: Use S-C-c, paste outside with normal
  system bind


* Org
#+begin_src elisp
(setq org-directory "~/org/")
#+end_src

Note that there's another directory setting at [[Org roam & Org UI]].

#+begin_src elisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))  ;; Why jupyter when you have this JK
#+end_src

Less "contained" org plugins (in the [[Plugins]] heading):
- [[Org roam & Org UI]]
- [[Org anki]]

Also see [[Org latex]]

** Org todo
I don't use org-agenda anymore so I won't be tangling this.

#+begin_src elisp :tangle no
(setq org-todo-keyword-faces
      '(("NOW" . "labelColor") ("CANCELED" . "systemRedColor") ("DONE" . "selectedControlColor") ("FINISH" . "selectedControlColor") ("PAST" . "controlTextColor")
        ("RECUR" . "systemYellowColor") ("MARK" . "systemOrangeColor") ("PLAN" . "systemBrownColor")
        ("OVERDUE". "systemRedColor") ("DUE" . "systemYellowColor") ("STARTED" . "labelColor")))
(setq diary-file "~/Documents/diary/diary")
#+end_src

** Org bullets
#+begin_src elisp
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src


* Plugins
** Treemacs
#+begin_src elisp
(after! treemacs
  (setq treemacs-width 20
        treemacs-project-follow-cleanup t)
  (treemacs-load-theme "Default"))
#+end_src

** Magit
Maybe I don't need this anymore? (Not tangled)

#+begin_src elisp :tangle no
(after! magit
  (custom-set-faces
   '(magit-diff-added-highlight ((((type tty)) (:background nil))))
   '(magit-diff-context-highlight ((((type tty)) (:background nil))))
   '(magit-diff-file-heading ((((type tty)) nil)))
   '(magit-diff-removed ((((type tty)) (:foreground "red"))))
   '(magit-diff-removed-highlight ((((type tty)) (:background nil))))
   '(magit-section-highlight ((((type tty)) nil)))
   '(magit-diff-highlight-hunk-body ((((type tty)) (:background nil))))
   '(magit-diff-base-highlight ((((type tty)) (:background nil))))))
#+end_src

** Elfeed
Note that I don't use elfeed anymore

#+begin_src elisp
;; Elfeed: Use sans for articles
(add-hook 'elfeed-show-mode-hook
      (lambda () (buffer-face-set 'variable-pitch)))
#+end_src

** Vterm
This is no longer tangled as I sort of realized vterm + evil is kinda good.

Good old neovim terminal vibes.
#+begin_src elisp :tangle no
(add-hook 'vterm-mode-hook
      (lambda () (visual-line-mode) (turn-off-evil-mode)))
#+end_src

#+begin_src elisp
(add-hook! 'vterm-mode-hook 'evil-insert)
#+end_src

** Company
Completion everywhere is annoying. Period.

Enable with =C-x C-o= or something, check with =C-x C-h= in insert mode.

#+begin_src elisp
(after! company
  (setq company-idle-delay nil))
(after! company-quickhelp
  (setq company-quickhelp-mode t))
#+end_src

#+begin_src elisp
(use-package! company
  :config
  (setq company-tooltip-align-annotations nil)
  (setq company-icon-size '(auto-scale . 64))
  (setq company-box-icons-all-the-icons
        (let ((all-the-icons-scale-factor 10.0))
          `((Unknown       . ,(all-the-icons-material "find_in_page"             :face 'all-the-icons-purple))
            (Text          . ,(all-the-icons-material "text_fields"              :face 'all-the-icons-green))
            (Method        . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
            (Function      . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
            (Constructor   . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
            (Field         . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
            (Variable      . ,(all-the-icons-material "adjust"                   :face 'all-the-icons-blue))
            (Class         . ,(all-the-icons-material "class"                    :face 'all-the-icons-red))
            (Interface     . ,(all-the-icons-material "settings_input_component" :face 'all-the-icons-red))
            (Module        . ,(all-the-icons-material "view_module"              :face 'all-the-icons-red))
            (Property      . ,(all-the-icons-material "settings"                 :face 'all-the-icons-red))
            (Unit          . ,(all-the-icons-material "straighten"               :face 'all-the-icons-red))
            (Value         . ,(all-the-icons-material "filter_1"                 :face 'all-the-icons-red))
            (Enum          . ,(all-the-icons-material "plus_one"                 :face 'all-the-icons-red))
            (Keyword       . ,(all-the-icons-material "filter_center_focus"      :face 'all-the-icons-red))
            (Snippet       . ,(all-the-icons-material "short_text"               :face 'all-the-icons-red))
            (Color         . ,(all-the-icons-material "color_lens"               :face 'all-the-icons-red))
            (File          . ,(all-the-icons-material "insert_drive_file"        :face 'all-the-icons-red))
            (Reference     . ,(all-the-icons-material "collections_bookmark"     :face 'all-the-icons-red))
            (Folder        . ,(all-the-icons-material "folder"                   :face 'all-the-icons-red))
            (EnumMember    . ,(all-the-icons-material "people"                   :face 'all-the-icons-red))
            (Constant      . ,(all-the-icons-material "pause_circle_filled"      :face 'all-the-icons-red))
            (Struct        . ,(all-the-icons-material "streetview"               :face 'all-the-icons-red))
            (Event         . ,(all-the-icons-material "event"                    :face 'all-the-icons-red))
            (Operator      . ,(all-the-icons-material "control_point"            :face 'all-the-icons-red))
            (TypeParameter . ,(all-the-icons-material "class"                    :face 'all-the-icons-red))
            (Template      . ,(all-the-icons-material "short_text"               :face 'all-the-icons-green))
            (ElispFunction . ,(all-the-icons-material "functions"                :face 'all-the-icons-red))
            (ElispVariable . ,(all-the-icons-material "check_circle"             :face 'all-the-icons-blue))
            (ElispFeature  . ,(all-the-icons-material "stars"                    :face 'all-the-icons-orange))
            (ElispFace     . ,(all-the-icons-material "format_paint"             :face 'all-the-icons-pink)))))
)

#+end_src

