.config/doom/config.org
*** Inline math symbols with latex
Completion for inserting Unicode symbols.

Type: =\al<C-x RET>=, and you'll get some suggestions like aleph ℵ, alpha α; accept one and what you typed will be replaced with that symbol.

As with before you should check with =C-x C-h= in insert mode for all options.

#+begin_src elisp
(require 'math-symbol-lists)
;; This is actually for C-\, then select input "math",
;; then the Ω will show in the status bar.
(quail-define-package "math" "UTF-8" "Ω" t)
;; (quail-define-rules ; add whatever extra rules you want to define here...
;;  ("\\from"    #X2190)
;;  ("\\to"      #X2192)
;;  ("\\lhd"     #X22B2)
;;  ("\\rhd"     #X22B3)
;;  ("\\unlhd"   #X22B4)
;;  ("\\unrhd"   #X22B5))
(mapc (lambda (x)
        (if (cddr x)
            (quail-defrule (cadr x) (car (cddr x)))))
      (append math-symbol-list-basic math-symbol-list-extended))

(add-to-list 'company-backends 'company-math-symbols-unicode)
#+end_src

*** Emoji

#+begin_src elisp
;; Emoji completion
(defun --set-emoji-font (frame)
  "Adjust the font settings of FRAME so Emacs can display emoji properly."
  (if (eq system-type 'darwin)
      ;; For NS/Cocoa
      (set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") frame 'prepend)
    ;; For Linux
    (set-fontset-font t 'symbol (font-spec :family "Symbola") frame 'prepend)))

;; For when Emacs is started in GUI mode:
(--set-emoji-font nil)
;; Hook for when a frame is created with emacsclient
;; see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html
(add-hook 'after-make-frame-functions '--set-emoji-font)
(require 'company-emoji)
(add-to-list 'company-backends 'company-emoji)
#+end_src

** Wrap region
This is essentially like =vim-surround= but more modern-IDE-like, y'know, how you can select some text in VS Code, press ="= and your selection is wrapped with quotes on both ends.

With evil mode on, select some text within evil's insert mode, then use quotes or brackets to surround selected region with those characters.

Below are definitions of more wrappers.

#+begin_src elisp
(use-package! wrap-region
  :config
  (wrap-region-add-wrappers
   '(("/* " " */" "#" (java-mode javascript-mode css-mode))
     ("`" "`" nil (markdown-mode org-mode))
     ("=" "=" nil (org-mode))
     ("~" "~" nil (org-mode))
     ("*" "*" nil (markdown-mode org-mode)))))

(add-hook! ('org-mode 'markdown-mode) 'wrap-region-mode)
#+end_src

This allows you to select some text in insert mode, press =`= and it will be wrapped with backticks on both sides, for example.

IMO this is friendly and customizable than vim-surround.

** Org roam & Org UI

#+begin_src elisp
(use-package! org-roam
  :ensure t
  :custom
  (org-roam-directory (file-truename "~/org/orgroam"))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  ;; If using org-roam-protocol
  (require 'org-roam-protocol))

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start nil))
#+end_src

** Org anki

#+begin_src elisp
(customize-set-variable 'org-anki-default-deck "Doom")
#+end_src

Below is from:

[[https://jeffkreeftmeijer.com/org-unable-to-resolve-link]]

#+begin_src elisp
(defun my/org-anki-sync-fix-refs ()
  "Fix 'Unable to resolve link: XXX'"
  (interactive)
  (org-id-update-id-locations
   (directory-files-recursively org-roam-directory "\\.org$")))
#+end_src

*** Templates

org-anki template for card front side with breadcumb of org file headings and a link to open the file in emacs from where the card is created from.

#+begin_src elisp
(customize-set-variable 'org-anki-field-templates
 '(("Basic"
    ("Front" . (lambda (it)        ;; strip text-properties
                (let ((breadcrumb (substring-no-properties
                                   ;; arguments:
                                   ;; - prepend file name?
                                   ;; - incl current heading?
                                   ;; - SEPARATOR
                                   ;; - return as string?
                                   (org-display-outline-path nil nil " > " t)))
                      (path (buffer-file-name)))
                  ;; "File Title: Heading > SubHeading > Sub-subheading"
                  (setq breadcrumb (concat (org-get-title) ": " breadcrumb))
                  (concat
                   (format
                    (concat "<div id=\"meta\">"
                              "<p id=\"breadcrumb\">%s</p>"
                              "<p id=\"open-file\">"
                                "<a href='emacs:///%s'>Open file</a>"
                              "</p>"
                            "</div>"
                            "<h3>%s</h3>")
                    breadcrumb path it (org-get-heading)))))))))
#+end_src

Note that:

The org heading originally was placed at the flashcard "front", but after some other configuration I made, it miraculously no longer showed on the flashcard...

So I modified the field template above to include the =<h3>(org-get-heading)</h3>= to fetch the front of card myself.

*Example AppleScript for =emacs://= handler*

Notice how in my field template I included an "Open file" link that links to the org file that the flashcard is created from, preceded by a =emacs://= scheme. Below is an example of how you can make this work so that clicking on the link would open the file in emacs for MacOS.

#+begin_src AppleScript :tangle no
on open location thisURL
    set thefile to (text 9 thru (count thisURL) of thisURL)
    do shell script "/usr/local/bin/emacsclient -c " & thefile
    return
end open location
#+end_src

You can save this as a =.scpt=, open with Script Editor, export -> as Application. Then configure the default app for =emacs://= to point to the Application you just saved.

AppleScript is rather delightful isn't it (not /s)

*Example CSS styling for anki card top section*

Top section as in the "Title: Heading1 > Heading2" and "Open file" line.

Displays the entire meta in one line with breadcumb on left, "Open file" on right.

#+begin_src css :tangle no
#meta {
  font-size: 1rem;
}
#breadcrumb {
  display: inline-block;
}
#open-file {
  display: inline-block;
  float: right;
}
#+end_src

*Example CSS for internal org links within anki*

If you're using org or org-roam links within flashcards to be synced with Anki, clicking on them would not be desirable when doing flashcards.

The below snippets selects all links other than the =#meta= section, and make them look muted, also unclickable.

#+begin_src css :tangle no
a:not(#meta a) {
  color: initial;
  text-decoration: none;
  font-size: 1rem;
  pointer-events: none;
}
#+end_src

Note that
- Setting color to initial allows anchor links to have the same color as normal flashcard text
- font-size setting would make it smaller than normal text, and same size as the =#meta= section
- The pointer-events setting makes it unclickable

** Org latex
*Installing dvisvgm*
- MacOS: Install MacTeX, or install through MacPorts/Homebrew
- Ubuntu/Debian/Fedora/Gentoo: package manager
- Windows: From website
- NetBSD: dvisvgm is now available on pkgsrc! Thanks Thomas
- Or use =tlmgr= to install dvisvgm after a texlive installation.

#+begin_src elisp
(setq org-latex-create-formula-image-program 'dvisvgm)
(plist-put org-format-latex-options :scale 4.0)
(plist-put org-format-latex-options :background nil)
#+end_src

*** TODO Scaling latex SVG overlays along with text
Unfixed issue :'/

Headings below are for my attempts to debug it...

The current status is basically, I've set the :scale to be 4.0 to make it
satisfactorily readable when generating the preview for the first time. Using
dvisvgm also allows it to be sharper. However I cannot find ANY method to scale
the previews along with text, NOR scale up individual SVG previews.

I did try with Vanilla emacs too. No luck.

I have since given up and have decided to let this issue sit for prosperity.

**** For testing
#+begin_src elisp
(defun my/scale-current-overlay ()
  (interactive)
  (pcase major-mode
    ('latex-mode
     (dolist (ov (overlays-in (point-min) (point-max)))
       (if (eq (overlay-get ov 'category)
               'preview-overlay)
           (my/text-scale--resize-fragment ov))))
    ('org-mode
     (dolist (ov (overlays-in (- (point) 10) (+ (point) 5) ))
       (if (eq (overlay-get ov 'org-overlay-type)
               'org-latex-overlay)
           (my/text-scale--resize-fragment ov))))))

(defun my/text-scale--resize-fragment (ov)
  (overlay-put
   ov 'display
   (cons 'image
         (plist-put
          (cdr (overlay-get ov 'display))
          'margin 'right-margin)))
  (overlay-put
   ov 'display
   (cons 'image
         (plist-put
          (cdr (overlay-get ov 'display))
          :scale 7.0))))
#+end_src

\begin{equation}
Hello \times world!
\end{equation}

Here is an aleph $\lim\limits_{\aleph\to\infty}(blah) = BLAH$

$\lim\limits_{N\to\infty} (\sum\limits_{i=0}^N else \space if) = else$

