.config/doom/config.org
*** Use package - eshell settings
#+begin_src elisp
(use-package! eshell
  ;;:type built-in
  ;;:custom (eshell-banner-message '(ha-eshell-banner))

  :init
  (setq eshell-error-if-no-glob t
        ;; This jumps back to the prompt:
        eshell-scroll-to-bottom-on-input 'all
        eshell-hist-ignoredups t
        eshell-save-history-on-exit t

        ;; Since eshell starts fast, let's dismiss it on exit:
        eshell-kill-on-exit t
        eshell-destroy-buffer-when-process-dies t

        ;; Can you remember the parameter differences between the
        ;; executables `chmod' and `find' and their Emacs counterpart?
        ;; Me neither, so this makes it act a bit more shell-like:
        eshell-prefer-lisp-functions nil))
#+end_src

*** EAT
#+begin_src elisp
(use-package eat
  :after eshell
  :bind
  (map! :map eat-mode-map "C-c C-d" #'eat-self-input)
  :hook (eshell-load . #'eat-eshell-mode))
#+end_src

** LSP
Don't show errors & warnings at the side. Show them when my point is on it.

#+begin_src elisp
(use-package! lsp
  :config
  (setq lsp-ui-sideline-enable nil)
  (setq lsp-headerline-breadcrumb-enable t)
  (setq lsp-lens-enable t))


#+end_src

**NOTE**: Flycheck mode can be toggled in doom with =SPC t f=
